**`teams/delius-core/oracle_db`** terragrunt plan on `push` event [#22](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this must be replaced
-/+ resource "aws_imagebuilder_distribution_configuration" "this" {
      ~ arn          = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-oracle-db" -> (known after apply)
      ~ date_created = "2023-05-24T14:07:30.019Z" -> (known after apply)
      ~ date_updated = "" -> (known after apply)
      ~ description  = "Delius Core Oracle Image" -> "Delius Core Oracle Database Image"
      ~ id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-oracle-db" -> (known after apply)
      ~ name         = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c" # forces replacement
      ~ tags         = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-oracle-db" -> (known after apply)
      ~ date_created                     = "2023-05-24T14:07:31.328Z" -> (known after apply)
      ~ date_last_run                    = "2023-05-24T14:08:35.285Z" -> (known after apply)
      ~ date_next_run                    = "2023-07-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-05-24T14:07:31.328Z" -> (known after apply)
      ~ description                      = "Delius Core Oracle Image" -> "Delius Core Oracle Database Image"
      ~ distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-oracle-db" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-oracle-db" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-oracle-db/0.0.1" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-oracle-db-0-0-1" -> (known after apply)
      ~ name                             = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c" # forces replacement
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-oracle-db/0.0.1" -> (known after apply)
      ~ date_created      = "2023-05-24T14:07:30.327Z" -> (known after apply)
      ~ description       = "Delius Core Oracle Image" -> "Delius Core Oracle Database Image" # forces replacement
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-oracle-db/0.0.1" -> (known after apply)
      ~ name              = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c" # forces replacement
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Linux" -> (known after apply)
      ~ tags              = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.1" -> "0.0.2" # forces replacement
      - working_directory = "" -> null
        # (1 unchanged attribute hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 20 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 20
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 20 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 20
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sde" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 20 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sde"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 20
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdj" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 20 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdj"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 20
              + volume_type           = "gp3"
            }
        }

      ~ component {
            # (1 unchanged attribute hidden)

          + parameter { # forces replacement
              + name  = "Ami"
              + value = "delius_core_ol_8_5_oracle_db_19c"
            }
          - parameter { # forces replacement
              - name  = "Ami" -> null
              - value = "delius_oracle_db" -> null
            }
          + parameter { # forces replacement
              + name  = "AnsibleTags"
              + value = "amibuild,oracle_19c_download"
            }
          - parameter { # forces replacement
              - name  = "Branch" -> null
              - value = "nit676-add-delius-core-oracle-db-config" -> null
            }
          + parameter { # forces replacement
              + name  = "Branch"
              + value = "nit677-hmpps-delius-core-db-improvements"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-oracle-db-0-0-1" -> (known after apply)
      ~ date_created                  = "2023-05-24T14:07:30.074Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ description                   = "Delius Core Oracle Image" -> "Delius Core Oracle Database Image"
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-oracle-db-0-0-1" -> (known after apply)
      ~ name                          = "delius_oracle_db_0_0_1" -> "delius_core_ol_8_5_oracle_db_19c_0_0_2" # forces replacement
      ~ resource_tags                 = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-pipeline"               = "delius_oracle_db" -> "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
          ~ "infrastructure-configuration" = "delius_oracle_db/0.0.1" -> "delius_core_ol_8_5_oracle_db_19c/0.0.2"
            # (8 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

      ~ logging {
          ~ s3_logs {
              ~ s3_key_prefix  = "delius" -> "delius_core_ol_8_5"
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.

```
